# --------------------------- Homework_6.1  ------------------------------------
"""
Виконав: Григорій Чернолуцький
Homework_6.1
Завдання_1. Розробити клас «домашня бібліотека». Передбачити обробник
(конструктор), який приймає ціле число – порядковий номер книги та словник, що містить
інформацію про книгу у наступному форматі:
1) автор;
2) назва;
3) видавництво;
4) жанр;
5) рік видання.
Реалізувати можливість роботи з довільним числом книг, пошук по книгах за
декількома параметрами (за автором, за роком видання, за жанром тощо), додавання книг у
бібліотеку, видалення книг з неї, доступу до книги за номером.
Передбачити демонстрацію (вивід до консолі) всіх сформованих елементів класу.

Package Version
------- -------
pip 23.2.1

"""
from task_3_1.Model.library import Library
from task_3_1.Model.book import Book

# --------------------------------- main module ----------------------------------------------
if __name__ == '__main__':
    print(" Класи 'Книга' і 'Бібліотека' ")
    library = Library()
    library.add(Book(1, "Mark Twain", "The Adventures of Tom Sawyer",
                     "Видавничий дім `Школа`", "Adventures", 1876))
    book2 = Book(2, "Mark Twain", "Adventures of Huckleberry Finn",
                 "Видавництво Старого Лева", "Adventures", 1884)
    book3 = Book(3, "Mark Twain", "Tom Sawyer Abroad",
                 "А-ба-ба-га-ла-ма-га", "Adventures", 1894)
    book4 = Book(4, "Mark Twain", "Tom Sawyer, Detective",
                 "Видавництво Старого Лева", "Детектив", 1896)
    book5 = Book(5, "Arthur Conan Doyle", "Этюд в багрових тонах",
                 "Видавництво \"Освіта\"", "Детектив", 1887)
    book6 = Book(6, "Arthur Conan Doyle", "Знак чотирьох",
                 "Видавництво Старого Лева", "Детектив", 1890)
    book7 = Book(7, "Arthur Conan Doyle", "Пригоди Шерлока Холмса",
                 "А-ба-ба-га-ла-ма-га", "Детектив", 1892)
    library.adds((book2, book3, book4, book5, book6, book7))
    library.draw()
    print("Видаляємо п'яту книгу")
    library.delete(book5)
    library.draw()
    print("Знайти за номером: \"2\"")
    library.found_by_number(2).draw()
    print("\nЗнайти за назвою: \"Tom Sawyer Abroad\"")
    library.found_by_name('Tom Sawyer Abroad').draw()
    print("\nЗнайти за автором \"Arthur Conan Doyle\" і роком видання \"1890\"")
    library.found_by_author_and_year('Arthur Conan Doyle', 1890).draw()
    print("Знайдемо всі детективи")
    library.found_by_genre('Детектив').draw()

''' 
РЕЗУЛЬТАТ

 Класи 'Книга' і 'Бібліотека' 
---------------------------------------------------------------------------------------------------
  №  Автор                 Назва                   Видавник            Жанр            Рік видання
---------------------------------------------------------------------------------------------------
 1 Mark Twain "The Adventures of Tom Sawyer" 'Видавничий дім `Школа`' Adventures 1876 рік
 2 Mark Twain "Adventures of Huckleberry Finn" 'Видавництво Старого Лева' Adventures 1884 рік
 3 Mark Twain "Tom Sawyer Abroad" 'А-ба-ба-га-ла-ма-га' Adventures 1894 рік
 4 Mark Twain "Tom Sawyer, Detective" 'Видавництво Старого Лева' Детектив 1896 рік
 5 Arthur Conan Doyle "Этюд в багрових тонах" 'Видавництво "Освіта"' Детектив 1887 рік
 6 Arthur Conan Doyle "Знак чотирьох" 'Видавництво Старого Лева' Детектив 1890 рік
 7 Arthur Conan Doyle "Пригоди Шерлока Холмса" 'А-ба-ба-га-ла-ма-га' Детектив 1892 рік

Видаляємо п'яту книгу
---------------------------------------------------------------------------------------------------
  №  Автор                 Назва                   Видавник            Жанр            Рік видання
---------------------------------------------------------------------------------------------------
 1 Mark Twain "The Adventures of Tom Sawyer" 'Видавничий дім `Школа`' Adventures 1876 рік
 2 Mark Twain "Adventures of Huckleberry Finn" 'Видавництво Старого Лева' Adventures 1884 рік
 3 Mark Twain "Tom Sawyer Abroad" 'А-ба-ба-га-ла-ма-га' Adventures 1894 рік
 4 Mark Twain "Tom Sawyer, Detective" 'Видавництво Старого Лева' Детектив 1896 рік
 6 Arthur Conan Doyle "Знак чотирьох" 'Видавництво Старого Лева' Детектив 1890 рік
 7 Arthur Conan Doyle "Пригоди Шерлока Холмса" 'А-ба-ба-га-ла-ма-га' Детектив 1892 рік

Знайти за номером: "2"
 2 Mark Twain "Adventures of Huckleberry Finn" 'Видавництво Старого Лева' Adventures 1884 рік

Знайти за назвою: "Tom Sawyer Abroad"
 3 Mark Twain "Tom Sawyer Abroad" 'А-ба-ба-га-ла-ма-га' Adventures 1894 рік

Знайти за автором "Arthur Conan Doyle" і роком видання "1890"
---------------------------------------------------------------------------------------------------
  №  Автор                 Назва                   Видавник            Жанр            Рік видання
---------------------------------------------------------------------------------------------------
 6 Arthur Conan Doyle "Знак чотирьох" 'Видавництво Старого Лева' Детектив 1890 рік

Знайдемо всі детективи
---------------------------------------------------------------------------------------------------
  №  Автор                 Назва                   Видавник            Жанр            Рік видання
---------------------------------------------------------------------------------------------------
 4 Mark Twain "Tom Sawyer, Detective" 'Видавництво Старого Лева' Детектив 1896 рік
 6 Arthur Conan Doyle "Знак чотирьох" 'Видавництво Старого Лева' Детектив 1890 рік
 7 Arthur Conan Doyle "Пригоди Шерлока Холмса" 'А-ба-ба-га-ла-ма-га' Детектив 1892 рік


'''
